Revit 2026 API

# NumberingSchemaGetMinimumNumberOfDigits Method

---

Returns the minimum number of digits to be used for formating the Number parameter of all enumerable elements of the given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static int GetMinimumNumberOfDigits(
	Document document
)
```
```vb
Public Shared Function GetMinimumNumberOfDigits (
	document As Document
) As Integer
```
```cpp
public:
static int GetMinimumNumberOfDigits(
	Document^ document
)
```
```fsharp
static member GetMinimumNumberOfDigits :
        document : Document -> int
```

#### Parameters

document Document
     The document this value is going to be applied to.

#### Return Value

Int32 The current number of formatting digits

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The number is used by all numbering schemas in the document.

The value can be modified by using the SetMinimumNumberOfDigits(Document, Int32) method.

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace